In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [7]:
booldf = df['W']>0

In [8]:
booldf

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [9]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df[df['W']>0][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [12]:
df[df[['W','Y']]>0]

          W   X         Y   Z
A  2.706850 NaN  0.907969 NaN
B  0.651118 NaN       NaN NaN
C       NaN NaN  0.528813 NaN
D  0.188695 NaN       NaN NaN
E  0.190794 NaN  2.605967 NaN

In [13]:
df[df[['W','Y']]>0][['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118       NaN
C       NaN  0.528813
D  0.188695       NaN
E  0.190794  2.605967

In [14]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
newind = 'CA NC AZ OH TN'.split()

In [23]:
newind

['CA', 'NC', 'AZ', 'OH', 'TN']

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df['State'] = newind

In [26]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NC
C -2.018168  0.740122  0.528813 -0.589001    AZ
D  0.188695 -0.758872 -0.933237  0.955057    OH
E  0.190794  1.978757  2.605967  0.683509    TN

In [28]:
df.set_index('State')

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NC     0.651118 -0.319318 -0.848077  0.605965
AZ    -2.018168  0.740122  0.528813 -0.589001
OH     0.188695 -0.758872 -0.933237  0.955057
TN     0.190794  1.978757  2.605967  0.683509

In [29]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [30]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [31]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [32]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [34]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [35]:
df['A']

G1  1    0.302665
    2   -1.706086
    3   -0.134841
G2  1    0.166905
    2    0.807706
    3    0.638787
Name: A, dtype: float64

In [36]:
df['B']

G1  1    1.693723
    2   -1.159119
    3    0.390528
G2  1    0.184502
    2    0.072960
    3    0.329646
Name: B, dtype: float64

In [37]:
df['B'][1]

-1.1591194155484297

In [40]:
df.loc['G1'].loc[1]['B']

1.693722925204035

In [39]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [41]:
df.index.names

FrozenList([None, None])

In [42]:
df.index.names = ['Groups','Num']

In [43]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [47]:
df.loc['G1'].loc[3]['B']

0.39052784273374097

In [55]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [52]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [54]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502